// 주석(comment): 컴파일 안됨, 노트정리

// 바이트(byte) : 정보의 최소단위
//   ㄴ 8 bit = 1 byte
//   ㄴ bit = 0 or 1
//   ㄴ 모든 프로그래밍 언어는 값을 Byte로 표현
//   ㄴ C언어는 int(정수형) -> 4 byte 표현
//   ㄴ 1Byte = 2^8 = 0~255
//   ㄴ 값을 표현할 때 큰 Byte를 할당하면 할수록 값의 범위도 커짐

// 문자 컴파일
//  ㄴ 문자는 -> 2진수 형태의 ASCII코드로 변환
//  ㄴ ex) 'A' -> 65
//  ㄴ 문자는 소스코드에서만 문자로 표현되고, 컴퓨터 안에서는 정수와 같은 방식으로 처리

// 문자 표현 방식
//  ㄴ UTF8(한글 표현)
//  ㄴ 일반적으로 영어 알파벳은은 2Byte로 표현
//  ㄴ 일반적으로 한글은 3Byte로 표현

// ASCII코드
//   ㄴ 사람이 사용하는 기호를 컴퓨터 안에서 표현하는 방법
//   ㄴ http://www.ascii-codes.com/